
## Plan Result (stg)




### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 3 to change, 1 to destroy.</code></pre>

* Update
  * azurerm_windows_virtual_machine.modernisation_windows[&#34;stgdartsmidmock&#34;]
  * module.sa-dets-standard[0].azurerm_storage_account.storage_account
  * module.sa-migration-standard[0].azurerm_storage_account.storage_account
* Replace
  * module.application_insights.azurerm_monitor_activity_log_alert.main[0]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_windows_virtual_machine.modernisation_windows["stgdartsmidmock"] will be updated in-place
  ~ resource "azurerm_windows_virtual_machine" "modernisation_windows" {
        id                                                     = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-stg-rg/providers/Microsoft.Compute/virtualMachines/stgdartsmidmock"
        name                                                   = "stgdartsmidmock"
      ~ patch_assessment_mode                                  = "AutomaticByPlatform" -> "ImageDefault"
        tags                                                   = {
            "application"         = "darts"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#darts-devs"
            "environment"         = "staging"
            "managedBy"           = "Darts Modernisation"
        }
        # (41 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.application_insights.azurerm_monitor_activity_log_alert.main[0] must be replaced
-/+ resource "azurerm_monitor_activity_log_alert" "main" {
      ~ id                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-stg-rg/providers/Microsoft.Insights/activityLogAlerts/Application Insights daily cap reached - darts-stg" -> (known after apply)
      ~ location            = "global" -> "uksouth" # forces replacement
        name                = "Application Insights daily cap reached - darts-stg"
        tags                = {
            "application"         = "darts"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#darts-devs"
            "environment"         = "staging"
            "managedBy"           = "Darts Modernisation"
        }
        # (4 unchanged attributes hidden)

      ~ criteria {
          - levels                  = [] -> null
          - resource_groups         = [] -> null
          - resource_ids            = [] -> null
          - resource_providers      = [] -> null
          - resource_types          = [] -> null
          - statuses                = [] -> null
          - sub_statuses            = [] -> null
            # (13 unchanged attributes hidden)

          ~ resource_health {
              + caller                  = (known after apply)
              + category                = (known after apply)
              + level                   = (known after apply)
              + levels                  = (known after apply)
              + operation_name          = (known after apply)
              + recommendation_category = (known after apply)
              + recommendation_impact   = (known after apply)
              + recommendation_type     = (known after apply)
              + resource_group          = (known after apply)
              + resource_groups         = (known after apply)
              + resource_id             = (known after apply)
              + resource_ids            = (known after apply)
              + resource_provider       = (known after apply)
              + resource_providers      = (known after apply)
              + resource_type           = (known after apply)
              + resource_types          = (known after apply)
              + status                  = (known after apply)
              + statuses                = (known after apply)
              + sub_status              = (known after apply)
              + sub_statuses            = (known after apply)
            } -> (known after apply)

          ~ service_health {
              + caller                  = (known after apply)
              + category                = (known after apply)
              + level                   = (known after apply)
              + levels                  = (known after apply)
              + operation_name          = (known after apply)
              + recommendation_category = (known after apply)
              + recommendation_impact   = (known after apply)
              + recommendation_type     = (known after apply)
              + resource_group          = (known after apply)
              + resource_groups         = (known after apply)
              + resource_id             = (known after apply)
              + resource_ids            = (known after apply)
              + resource_provider       = (known after apply)
              + resource_providers      = (known after apply)
              + resource_type           = (known after apply)
              + resource_types          = (known after apply)
              + status                  = (known after apply)
              + statuses                = (known after apply)
              + sub_status              = (known after apply)
              + sub_statuses            = (known after apply)
            } -> (known after apply)
        }

        # (1 unchanged block hidden)
    }

  # module.sa-dets-standard[0].azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-stg-rg/providers/Microsoft.Storage/storageAccounts/stgdetsdarts"
        name                              = "stgdetsdarts"
      ~ sftp_enabled                      = true -> false
        tags                              = {
            "application"         = "darts"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#darts-devs"
            "environment"         = "staging"
            "managedBy"           = "Darts Modernisation"
        }
        # (62 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sa-migration-standard[0].azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-migration-stg-rg/providers/Microsoft.Storage/storageAccounts/sastgdartsmig02"
        name                              = "sastgdartsmig02"
      ~ sftp_enabled                      = true -> false
        tags                              = {
            "application"         = "darts"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#darts-devs"
            "environment"         = "staging"
            "managedBy"           = "Darts Modernisation"
        }
        # (62 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

Plan: 1 to add, 3 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":275,"Program":"tfcmt","SHA1":"","Target":"stg","Vars":{}} -->